brew "xz"
brew "openssl@3"
brew "ffmpeg"
brew "auto-editor"
brew "readline"
brew "bash-completion@2"
brew "bat"
brew "btop"
brew "chafa"
brew "cmake"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "htop"
brew "just"
brew "sqlite"
brew "nano"
brew "neovim"
brew "ollama"
brew "p7zip"
brew "pandoc"
brew "pkgconf"
brew "pyenv"
brew "ripgrep"
brew "shellcheck"
brew "sox"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "vhs"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "wrk"
brew "zlib"
cask "aldente"
cask "alt-tab"
cask "capcut"
cask "codex"
cask "docker-desktop"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "keycastr"
cask "obs"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "natqe.reload"
vscode "omthemes.omthemes"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
uv "langgraph-cli[inmem]"
uv "mypy"
uv "pyright"
uv "ruff"
